Revit 2027 API
TableData.GetSectionData(Int32) Method
 Returns the section data array element at the specified index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableSectionData GetSectionData(
	int nIndex
)
Public Function GetSectionData (
	nIndex As Integer
) As TableSectionData
public:
TableSectionData^ GetSectionData(
	int nIndex
)
member GetSectionData :
        nIndex : int -> TableSectionData
Parameters
nIndex Int32
 The index of section data array. If the index is out of the boundary of section data array, null is returned.
Return Value
TableSectionData
See Also
Reference
TableData Class
GetSectionData Overload
Autodesk.Revit.DB Namespace